todos/2024/2024-10/2024-10-19.org
#+OPTIONS: ^:{} H:0 num:0

* 2024-10-11
** Utopia
- [X] integrant
- [X] migratus
- [X] conman
- [X] with-utopia-transaction
- [X] utopia-query-fn
- [X] with-dynamic-transaction
- [X] dynamic-query
- [X] basic http server
- [X] actions - hello world
- [ ] web setting
- [ ] test setting
- [ ] cljs setting
- [ ] web socket setting
** 개인 공부
*** Computer Networking
**** 3. 트랜스포트 계층
- [X] 3.6. 혼잡제어의 원리
- [ ] 3.7. TCP 혼잡제어
- [ ] 3.8. 요약
*** Docker
*** Kubernetes
*** Jenkins
*** Elk Stack
*** Prometheus Grafana
*** 데이터베이스 시스템
*** Kafka
*** Hadoop
*** Hive
*** Scala
*** Spark
*** 데이터 중심 애플리케이션 설계
*** gRPC
*** nginX
*** Category Theory For Programmers
*** Structure and Interpretation of Computer Programs
*** The Joy of Clojure
*** Clojure 최적화
*** MongoDB
*** Redis
*** C++ 기초 플러스
*** CUDA C Programming
*** 밑바닥부터 시작하는 딥러닝
*** 밑바닥부터 시작하는 딥러닝 2
*** 밑바닥부터 시작하는 딥러닝 3
*** 핸즈온 머신러닝
*** Scala 머신러닝
*** SQL (고급사용 및 최적화)
*** Java 최적화
