todos/2024/2024-10/2024-10-19.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-01 Fri 15:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="kwonryul" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="file:///home/kwonryul/.emacs.d/css/org.css" />
</head>
<body>
<div id="content" class="content">

<ul class="org-ul">
<li><a id="org3d1d0de"></a>2024-10-20<br />
<ul class="org-ul">
<li><a id="orgfbd8c56"></a>Utopia<br />
<div class="outline-text-3" id="text-orgfbd8c56">
<ul class="org-ul">
<li class="on"><code>[X]</code> Utopia 시작</li>
<li class="on"><code>[X]</code> integrant</li>
<li class="on"><code>[X]</code> migratus</li>
<li class="on"><code>[X]</code> conman</li>
<li class="on"><code>[X]</code> with-utopia-transaction</li>
<li class="on"><code>[X]</code> utopia-query-fn</li>
<li class="on"><code>[X]</code> with-dynamic-transaction</li>
<li class="on"><code>[X]</code> dynamic-query</li>
<li class="on"><code>[X]</code> basic http server</li>
<li class="on"><code>[X]</code> actions - hello world</li>
<li class="off"><code>[&#xa0;]</code> web setting</li>
<li class="off"><code>[&#xa0;]</code> test setting</li>
<li class="off"><code>[&#xa0;]</code> cljs setting</li>
<li class="off"><code>[&#xa0;]</code> web socket setting</li>
</ul>
</div>
</li>
<li><a id="org7fc93e3"></a>개인 공부<br />
<ul class="org-ul">
<li><a id="orge0752fb"></a>Computer Networking<br />
<ul class="org-ul">
<li><a id="org1c79896"></a>3. 트랜스포트 계층<br />
<div class="outline-text-5" id="text-org1c79896">
<ul class="org-ul">
<li class="on"><code>[X]</code> 3.6. 혼잡제어의 원리</li>
<li class="off"><code>[&#xa0;]</code> 3.7. TCP 혼잡제어</li>
<li class="off"><code>[&#xa0;]</code> 3.8. 요약</li>
</ul>
</div>
</li>
</ul>
</li>
<li><a id="org6da8a54"></a>Docker<br /></li>
<li><a id="org8da5059"></a>Kubernetes<br /></li>
<li><a id="org4f7058b"></a>Jenkins<br /></li>
<li><a id="org1b2a405"></a>Elk Stack<br /></li>
<li><a id="org543b6e6"></a>Prometheus Grafana<br /></li>
<li><a id="org3c7e13e"></a>데이터베이스 시스템<br /></li>
<li><a id="org7481245"></a>Kafka<br /></li>
<li><a id="org1127ee4"></a>Hadoop<br /></li>
<li><a id="org707fd6f"></a>Hive<br /></li>
<li><a id="orgacbd11d"></a>Scala<br /></li>
<li><a id="orgdad0653"></a>Spark<br /></li>
<li><a id="org6d940f1"></a>데이터 중심 애플리케이션 설계<br /></li>
<li><a id="org156657b"></a>gRPC<br /></li>
<li><a id="org047ab5d"></a>nginX<br /></li>
<li><a id="org49e163e"></a>Category Theory For Programmers<br /></li>
<li><a id="org59dfd04"></a>Structure and Interpretation of Computer Programs<br /></li>
<li><a id="org58ca906"></a>The Joy of Clojure<br /></li>
<li><a id="org427a7b6"></a>Clojure 최적화<br /></li>
<li><a id="org43343d8"></a>MongoDB<br /></li>
<li><a id="orgebc1f01"></a>Redis<br /></li>
<li><a id="orga6f444b"></a>C++ 기초 플러스<br /></li>
<li><a id="org8914374"></a>CUDA C Programming<br /></li>
<li><a id="org7d72366"></a>밑바닥부터 시작하는 딥러닝<br /></li>
<li><a id="org03484b3"></a>밑바닥부터 시작하는 딥러닝 2<br /></li>
<li><a id="orgacb567b"></a>밑바닥부터 시작하는 딥러닝 3<br /></li>
<li><a id="org2d58ec7"></a>핸즈온 머신러닝<br /></li>
<li><a id="org04b6129"></a>Scala 머신러닝<br /></li>
<li><a id="org256dade"></a>SQL (고급사용 및 최적화)<br /></li>
<li><a id="orga0a836e"></a>Java 최적화<br /></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
<div id="postamble" class="status">
<p class="author">Author: kwonryul</p>
<p class="date">Created: 2024-11-01 Fri 15:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
